# St7GetNumLoadPathTemplateDistributedForces

Returns the number of distributed forces assigned to the specified load path template.

long St7GetNumLoadPathTemplateDistributedForces(long uID, long TemplateID,
long Vehicle, long* NumDistributedForces)
Input Parameters
uID
Strand7 model file ID.
TemplateID
Load path template ID.
Vehicle
Vehicle number.
Output Parameters
NumDistributedForces
Number of distributed forces.